In [3]:
import pandas as pd

In [4]:
eleve=pd.read_excel("/home/babacar/Downloads/proget_edacy.xlsx", index_col=None)

In [5]:
eleve

        Nom  Prenom     Adress  Moyenne  Age  Region     Specialité Sexe
0     diene   binta       yoff       14   18   dakar           data    f
1  diakhate     awa  guediaway       14   23   dakar  developpement    f
2        ba    omar     ouakam       15   17  France           data    m
3      lilo  malado    liberte        9   19   dakar         mobile    m
4     khoss   sossi    mariste       15   27   thies            web    m

In [6]:
admis=eleve[eleve["Moyenne"]>10]

In [7]:
admis

        Nom Prenom     Adress  Moyenne  Age  Region     Specialité Sexe
0     diene  binta       yoff       14   18   dakar           data    f
1  diakhate    awa  guediaway       14   23   dakar  developpement    f
2        ba   omar     ouakam       15   17  France           data    m
4     khoss  sossi    mariste       15   27   thies            web    m

In [8]:
admis.to_excel("/home/babacar/Downloads/proget_edacy_admis.xlsx")

In [9]:
eleve_adulte=eleve[eleve["Age"]>20]

In [10]:
eleve_adulte

        Nom Prenom     Adress  Moyenne  Age Region     Specialité Sexe
1  diakhate    awa  guediaway       14   23  dakar  developpement    f
4     khoss  sossi    mariste       15   27  thies            web    m

In [12]:
eleve_adulte.to_excel("/home/babacar/Downloads/proget_edacy_eleveAdulte.xlsx")

In [13]:
moyenne_ecole=eleve["Moyenne"].mean()

In [14]:
moyenne_ecole

13.4

In [15]:
filles=eleve[eleve["Sexe"]=="f"]

In [16]:
filles

        Nom Prenom     Adress  Moyenne  Age Region     Specialité Sexe
0     diene  binta       yoff       14   18  dakar           data    f
1  diakhate    awa  guediaway       14   23  dakar  developpement    f

In [17]:
filles["Nom"].count()

2

In [18]:
pourcentage_filles=(filles["Nom"].count()/eleve["Nom"].count())*100

In [19]:
pourcentage_filles

40.0

In [20]:
garçons=eleve[eleve["Sexe"]=="m"]

In [21]:
garçons["Nom"].count()

3

In [22]:
pourcentage_garçons=(garçons["Nom"].count()/eleve["Nom"].count())*100

In [23]:
pourcentage_garçons

60.0

In [24]:
region_meilleurs_eleves=eleve.sort_values(by="Moyenne", ascending=False)

In [25]:
region_meilleurs_eleves

        Nom  Prenom     Adress  Moyenne  Age  Region     Specialité Sexe
2        ba    omar     ouakam       15   17  France           data    m
4     khoss   sossi    mariste       15   27   thies            web    m
0     diene   binta       yoff       14   18   dakar           data    f
1  diakhate     awa  guediaway       14   23   dakar  developpement    f
3      lilo  malado    liberte        9   19   dakar         mobile    m

In [26]:
region_meilleurs_eleves=region_meilleurs_eleves["Region"].head(1)

In [27]:
region_meilleurs_eleves

2    France
Name: Region, dtype: object

In [28]:
d={'moyenne_ecole':moyenne_ecole, 'pourcentage_filles':pourcentage_filles,  'pourcentage_garçons':pourcentage_garçons,
      'region_meilleurs_eleves':region_meilleurs_eleves}

In [29]:
stats_globales_ecole=pd.DataFrame(data=d)

In [30]:
stats_globales_ecole

,moyenne_ecole,pourcentage_filles,pourcentage_garçons,region_meilleurs_eleves
2,13.4,40.0,60.0,France

In [31]:
stats_globales_ecole.to_excel("/home/babacar/Downloads/proget_edacy_stats_globales_ecole.xlsx")